In [2]:
import pandas as pd

In [4]:
dict={
      'Name': ['Mirage', 'Jerusa', 'Avishek', 'Ashaya', 'Parbat', 'Prekshya', 'Rachel'],
      'Marks':[98,96,95,97,94,89,85],
      'Gender':['Male', 'Female', 'Male', 'Male', 'Male', 'Female', 'Female']
     }
df=pd.DataFrame(dict)
df

       Name  Marks  Gender
0    Mirage     98    Male
1    Jerusa     96  Female
2   Avishek     95    Male
3    Ashaya     97    Male
4    Parbat     94    Male
5  Prekshya     89  Female
6    Rachel     85  Female

In [5]:
df.head()

      Name  Marks  Gender
0   Mirage     98    Male
1   Jerusa     96  Female
2  Avishek     95    Male
3   Ashaya     97    Male
4   Parbat     94    Male

In [7]:
df.tail()

       Name  Marks  Gender
2   Avishek     95    Male
3    Ashaya     97    Male
4    Parbat     94    Male
5  Prekshya     89  Female
6    Rachel     85  Female

In [9]:
df.shape

(7, 3)

In [10]:
print('No of Rows', df.shape[0])
print('No of Columns', df.shape[1])

No of Rows 7
No of Columns 3

In [13]:
df.isnull().sum(axis=0)

Name      0
Marks     0
Gender    0
dtype: int64

In [15]:
df.describe(include='all')

          Name      Marks Gender
count        7   7.000000      7
unique       7        NaN      2
top     Mirage        NaN   Male
freq         1        NaN      4
mean       NaN  93.428571    NaN
std        NaN   4.720775    NaN
min        NaN  85.000000    NaN
25%        NaN  91.500000    NaN
50%        NaN  95.000000    NaN
75%        NaN  96.500000    NaN
max        NaN  98.000000    NaN

In [16]:
df['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [18]:
df['Gender'].nunique()

2

In [19]:
df['Gender'].value_counts()

Gender
Male      4
Female    3
Name: count, dtype: int64

In [21]:
df[df['Marks']>=90]

      Name  Marks  Gender
0   Mirage     98    Male
1   Jerusa     96  Female
2  Avishek     95    Male
3   Ashaya     97    Male
4   Parbat     94    Male

In [24]:
df[df['Marks']>90]

      Name  Marks  Gender
0   Mirage     98    Male
1   Jerusa     96  Female
2  Avishek     95    Male
3   Ashaya     97    Male
4   Parbat     94    Male

In [27]:
len(df[(df['Marks']>90) & (df['Marks']<100)])

5

In [29]:
sum(df['Marks'].between(90, 100))

5

In [35]:
def marks(x):
    return x//2

df['Half_Marks']=df['Marks'].apply(marks)
df

       Name  Marks  Gender  Half_Marks
0    Mirage     98    Male          49
1    Jerusa     96  Female          48
2   Avishek     95    Male          47
3    Ashaya     97    Male          48
4    Parbat     94    Male          47
5  Prekshya     89  Female          44
6    Rachel     85  Female          42

In [36]:
df['Marks'].apply(lambda x:x/2)

0    49.0
1    48.0
2    47.5
3    48.5
4    47.0
5    44.5
6    42.5
Name: Marks, dtype: float64

In [37]:
df['Name'].apply(len)

0    6
1    6
2    7
3    6
4    6
5    8
6    6
Name: Name, dtype: int64

In [40]:
df

       Name  Marks  Gender  Half_Marks
0    Mirage     98    Male          49
1    Jerusa     96  Female          48
2   Avishek     95    Male          47
3    Ashaya     97    Male          48
4    Parbat     94    Male          47
5  Prekshya     89  Female          44
6    Rachel     85  Female          42

In [52]:
df['Male_Female']=df['Gender'].map({'Male':1, 'Female':0})

In [53]:
df

       Name  Marks  Gender  Half_Marks  Male_Female
0    Mirage     98    Male          49            1
1    Jerusa     96  Female          48            0
2   Avishek     95    Male          47            1
3    Ashaya     97    Male          48            1
4    Parbat     94    Male          47            1
5  Prekshya     89  Female          44            0
6    Rachel     85  Female          42            0

In [65]:
df

       Name  Marks  Gender
0    Mirage     98    Male
1    Jerusa     96  Female
2   Avishek     95    Male
3    Ashaya     97    Male
4    Parbat     94    Male
5  Prekshya     89  Female
6    Rachel     85  Female

In [67]:
df.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [86]:
df.index

In [91]:
dict={
      'Name': ['Mirage', 'Jerusa', 'Avishek', 'Ashaya', 'Parbat', 'Prekshya', 'Rachel'],
      'Marks':[98,96,95,97,94,89,85],
      'Gender':['Male', 'Female', 'Male', 'Male', 'Male', 'Female', 'Female']
     }
df=pd.DataFrame(dict)
df

       Name  Marks  Gender
0    Mirage     98    Male
1    Jerusa     96  Female
2   Avishek     95    Male
3    Ashaya     97    Male
4    Parbat     94    Male
5  Prekshya     89  Female
6    Rachel     85  Female

In [93]:
df.sort_values(by='Marks', ascending=False)

       Name  Marks  Gender
0    Mirage     98    Male
3    Ashaya     97    Male
1    Jerusa     96  Female
2   Avishek     95    Male
4    Parbat     94    Male
5  Prekshya     89  Female
6    Rachel     85  Female

In [96]:
df[df['Gender']=='Female'][['Name', 'Marks']]

       Name  Marks
1    Jerusa     96
5  Prekshya     89
6    Rachel     85